Автоматизация документооборота/Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Автоматизация документооборота/Catalogs/Договоры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция СократитьФИО(ПолноеФИО)
	
	Части = СтрРазделить(ПолноеФИО, " ", Ложь);
	Если Части.Количество() < 2 Тогда
		Возврат ПолноеФИО;
	КонецЕсли;
	
	Результат = Части[0] + " " + Лев(Части[1], 1) + ".";
	Если Части.Количество() > 2 Тогда
		Результат = Результат + Лев(Части[2], 1) + ".";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтформатироватьДатуДоговора(ДатаДоговора)
	
	// Полный формат даты: "9 июля 2026 г." -> "«09» июля 2026 г."
	ПолнаяДата = Формат(ДатаДоговора, "ДЛФ=DD");
	ПозицияПробела = Найти(ПолнаяДата, " ");
	Если ПозицияПробела = 0 Тогда
		Возврат ПолнаяДата;
	КонецЕсли;
	
	День = Формат(ДатаДоговора, "ДФ=dd");
	Возврат "«" + День + "»" + Сред(ПолнаяДата, ПозицияПробела);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтформатироватьКодПодразделения(КодПодразделения)
	
	КодПодразделения = СокрЛП(КодПодразделения);
	Если СтрДлина(КодПодразделения) = 6 Тогда
		Возврат Лев(КодПодразделения, 3) + "-" + Прав(КодПодразделения, 3);
	КонецЕсли;
	
	Возврат КодПодразделения;
	
КонецФункции

&НаСервереБезКонтекста
Функция РасшифроватьОрганизационнуюФорму(Знач НаименованиеОрганизации, Знач Прописными = Ложь)
	
	НаименованиеОрганизации = СокрЛП(НаименованиеОрганизации);
	Если ПустаяСтрока(НаименованиеОрганизации) Тогда
		Возврат НаименованиеОрганизации;
	КонецЕсли;
	
	Позиция = Найти(НаименованиеОрганизации, " ");
	Если Позиция = 0 Тогда
		Аббревиатура = НаименованиеОрганизации;
		Остаток = "";
	Иначе
		Аббревиатура = Лев(НаименованиеОрганизации, Позиция - 1);
		Остаток = Сред(НаименованиеОрганизации, Позиция);
	КонецЕсли;
	
	Аббревиатура = ВРег(Аббревиатура);
	Расшифровка = Неопределено;
	
	Если Аббревиатура = "ООО" Тогда
		Расшифровка = "Общество с ограниченной ответственностью";
	ИначеЕсли Аббревиатура = "ОАО" Тогда
		Расшифровка = "Открытое акционерное общество";
	ИначеЕсли Аббревиатура = "ЗАО" Тогда
		Расшифровка = "Закрытое акционерное общество";
	ИначеЕсли Аббревиатура = "ПАО" Тогда
		Расшифровка = "Публичное акционерное общество";
	ИначеЕсли Аббревиатура = "АО" Тогда
		Расшифровка = "Акционерное общество";
	ИначеЕсли Аббревиатура = "ИП" Тогда
		Расшифровка = "Индивидуальный предприниматель";
	ИначеЕсли Аббревиатура = "ЧП" Тогда
		Расшифровка = "Частный предприниматель";
	ИначеЕсли Аббревиатура = "КФХ" Тогда
		Расшифровка = "Крестьянское (фермерское) хозяйство";
	КонецЕсли;
	
	Если Расшифровка = Неопределено Тогда
		Если Прописными Тогда
			Возврат ВРег(НаименованиеОрганизации);
		Иначе
			Возврат НаименованиеОрганизации;
		КонецЕсли;
	КонецЕсли;
	
	Если Прописными Тогда
		Возврат Расшифровка + ВРег(Остаток);
	Иначе
		Возврат Расшифровка + Остаток;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СклонениеВРодительномФИО(ФИО)
	
	Части = СтрРазделить(ФИО, " ", Ложь);
	Если Части.Количество() < 2 Тогда
		Возврат ФИО;
	КонецЕсли;
	
	// Пол определяем по отчеству: -вич/-ич - мужской род
	Мужчина = Ложь;
	Если Части.Количество() > 2 И Прав(Части[2], 2) = "ич" Тогда
		Мужчина = Истина;
	КонецЕсли;
	
	Результат = СклонениеФамилии(Части[0], Мужчина) + " " + СклонениеИмени(Части[1], Мужчина);
	Если Части.Количество() > 2 Тогда
		Результат = Результат + " " + СклонениеОтчества(Части[2], Мужчина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СклонениеФамилии(Фамилия, Мужчина)
	
	Если СтрДлина(Фамилия) = 0 Тогда
		Возврат Фамилия;
	КонецЕсли;
	
	Длина = СтрДлина(Фамилия);
	Последний = Прав(Фамилия, 1);
	
	Если Не Мужчина Тогда
		Если Последний = "а" Тогда
			Возврат Лев(Фамилия, Длина - 1) + "ой";
		ИначеЕсли Последний = "я" Тогда
			Возврат Лев(Фамилия, Длина - 1) + "ей";
		КонецЕсли;
		Возврат Фамилия;
	КонецЕсли;
	
	Если Последний = "ь" Тогда
		Возврат Лев(Фамилия, Длина - 1) + "я";
	ИначеЕсли Последний = "й" Тогда
		Возврат Лев(Фамилия, Длина - 1) + "я";
	ИначеЕсли Последний = "а" ИЛИ Последний = "я" ИЛИ Последний = "о" ИЛИ Последний = "е" ИЛИ Последний = "у" ИЛИ Последний = "и" Тогда
		Возврат Фамилия;
	КонецЕсли;
	
	Возврат Фамилия + "а";
	
КонецФункции

&НаСервереБезКонтекста
Функция СклонениеИмени(Имя, Мужчина)
	
	Если СтрДлина(Имя) = 0 Тогда
		Возврат Имя;
	КонецЕсли;
	
	Длина = СтрДлина(Имя);
	Последний = Прав(Имя, 1);
	
	Если Мужчина Тогда
		Если Последний = "й" Тогда
			Возврат Лев(Имя, Длина - 1) + "я";
		ИначеЕсли Последний = "ь" Тогда
			Возврат Лев(Имя, Длина - 1) + "я";
		ИначеЕсли Последний = "а" ИЛИ Последний = "я" Тогда
			Возврат Имя;
		КонецЕсли;
		Возврат Имя + "а";
	КонецЕсли;
	
	Если Последний = "я" Тогда
		Возврат Лев(Имя, Длина - 1) + "и";
	ИначеЕсли Последний = "а" Тогда
		Возврат Лев(Имя, Длина - 1) + "ы";
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

&НаСервереБезКонтекста
Функция СклонениеОтчества(Отчество, Мужчина)
	
	Если СтрДлина(Отчество) = 0 Тогда
		Возврат Отчество;
	КонецЕсли;
	
	Если Мужчина Тогда
		Если Прав(Отчество, 1) = "ч" Тогда
			Возврат Отчество + "а";
		КонецЕсли;
		Возврат Отчество;
	КонецЕсли;
	
	Если Прав(Отчество, 1) = "а" Тогда
		Возврат Лев(Отчество, СтрДлина(Отчество) - 1) + "ы";
	КонецЕсли;
	
	Возврат Отчество;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеИзБазыНаСервере(Данные, СсылкаНаОрганизацию, СсылкаНаСотрудника)
	
	// 1. Читаем данные организации
	Если ЗначениеЗаполнено(СсылкаНаОрганизацию) Тогда
		Данные.Вставить("НазваниеОрганизации", СсылкаНаОрганизацию.Наименование);
		Данные.Вставить("НазваниеОрганизацииПолное", РасшифроватьОрганизационнуюФорму(СсылкаНаОрганизацию.Наименование));
		Данные.Вставить("НазваниеОрганизацииВНачале", РасшифроватьОрганизационнуюФорму(СсылкаНаОрганизацию.Наименование, Истина));
		Данные.Вставить("НазваниеОрганизацииСокращенное", ВРег(СсылкаНаОрганизацию.Наименование));
		Данные.Вставить("Директор",            СсылкаНаОрганизацию.Директор);
		Данные.Вставить("ДиректорСокращенно",     СократитьФИО(СсылкаНаОрганизацию.Директор));
		Данные.Вставить("ДиректорВРодительном",   СклонениеВРодительномФИО(СсылкаНаОрганизацию.Директор));
		Данные.Вставить("ОГРН",                СсылкаНаОрганизацию.ОГРН);
		Данные.Вставить("ИНН",                 СсылкаНаОрганизацию.ИНН);
		Данные.Вставить("КПП",                 СсылкаНаОрганизацию.КПП);
		Данные.Вставить("ЮридическийАдрес",    СсылкаНаОрганизацию.ЮридическийАдрес);
		Данные.Вставить("РасчетныйСчет",       СсылкаНаОрганизацию.РасчетныйСчет);
		Данные.Вставить("КорСчет",             СсылкаНаОрганизацию.КорСчет);
		Данные.Вставить("Банк",                СсылкаНаОрганизацию.Банк);
		Данные.Вставить("БИК",                 СсылкаНаОрганизацию.БИК);
	Иначе
		Данные.Вставить("НазваниеОрганизации", "[Организация не выбрана]");
		Данные.Вставить("НазваниеОрганизацииПолное", "[Организация не выбрана]");
		Данные.Вставить("НазваниеОрганизацииВНачале", "[Организация не выбрана]");
		Данные.Вставить("НазваниеОрганизацииСокращенное", "[Организация не выбрана]");
		Данные.Вставить("Директор",            "");
		Данные.Вставить("ДиректорСокращенно",     "");
		Данные.Вставить("ДиректорВРодительном",   "");
		Данные.Вставить("ОГРН",                "");
		Данные.Вставить("ИНН",                 "");
		Данные.Вставить("КПП",                 "");
		Данные.Вставить("ЮридическийАдрес",    "");
		Данные.Вставить("РасчетныйСчет",       "");
		Данные.Вставить("КорСчет",             "");
		Данные.Вставить("Банк",                "");
		Данные.Вставить("БИК",                 "");
	КонецЕсли;
	
	// 2. Читаем данные сотрудника
	Если ЗначениеЗаполнено(СсылкаНаСотрудника) Тогда
		Данные.Вставить("ФИО",                     СсылкаНаСотрудника.Наименование);
		Данные.Вставить("ФИОСокращенно",           СократитьФИО(СсылкаНаСотрудника.Наименование)); 
		Данные.Вставить("ПаспортСерияНомер",       СсылкаНаСотрудника.ПаспортСерияНомер);
		Данные.Вставить("ПаспортКемВыдан",         СсылкаНаСотрудника.ПаспортКемВыдан);
		Данные.Вставить("ПаспортКогдаВыдан",       СсылкаНаСотрудника.ПаспортКогдаВыдан);
		Данные.Вставить("ПаспортКодПодразделения", СсылкаНаСотрудника.ПаспортКодПодразделения);
		Данные.Вставить("Телефон",                 СсылкаНаСотрудника.Телефон);
		Данные.Вставить("АдресРегистрации",        СсылкаНаСотрудника.АдресРегистрации);
		Данные.Вставить("ИННИсполнителя",          СсылкаНаСотрудника.ИНН);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьДоговорНаСервере(Данные)
	
	// 1. Получаем HTML-код напрямую из текстового макета базы 1С
	ТекстДокумента = Справочники.Договоры.ПолучитьМакет("ШаблонДоговораHTML").ПолучитьТекст();
	
	// 2. Делаем замену маркеров в тексте HTML
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[НазваниеОрганизации]", Данные.НазваниеОрганизации);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[НазваниеОрганизацииВНачале]", Данные.НазваниеОрганизацииВНачале);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[НазваниеОрганизацииПолное]", Данные.НазваниеОрганизацииПолное);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[НазваниеОрганизацииСокращенное]", Данные.НазваниеОрганизацииСокращенное);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[Директор]",            Данные.Директор);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ДиректорСокращенно]",Данные.ДиректорСокращенно);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ДиректорВРодительном]",Данные.ДиректорВРодительном);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ОГРН]",                Данные.ОГРН);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ИНН]",                 Данные.ИНН);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[КПП]",                 Данные.КПП);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ЮридическийАдрес]", Данные.ЮридическийАдрес);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[РасчетныйСчет]",    Данные.РасчетныйСчет);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[КорСчет]",          Данные.КорСчет);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[Банк]",             Данные.Банк);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[БИК]",              Данные.БИК);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[НомерДоговора]",       Данные.НомерДоговора);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ДатаДоговора]",        ОтформатироватьДатуДоговора(Данные.ДатаДоговора));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ФИО]",                 Данные.ФИО);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ПаспортСерияНомер]",   Данные.ПаспортСерияНомер);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ПаспортКемВыдан]",     Данные.ПаспортКемВыдан);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ПаспортКогдаВыдан]",   Формат(Данные.ПаспортКогдаВыдан, "ДЛФ=D"));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ПаспортКодПодразделения]",ОтформатироватьКодПодразделения(Данные.ПаспортКодПодразделения));
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[Телефон]",             Данные.Телефон);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[АдресРегистрации]",    Данные.АдресРегистрации);
ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ИННИсполнителя]",   Данные.ИННИсполнителя);
	ТекстДокумента = СтрЗаменить(ТекстДокумента, "[ФИОСокращенно]",     Данные.ФИОСокращенно);
	
	// 3. Записываем готовый файл во внутреннюю временную папку НА СЕРВЕРЕ
	ПутьКФайлу = КаталогВременныхФайлов() + "dogovor_preview.html";
	Запись = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	Запись.Записать(ТекстДокумента);
	Запись.Закрыть();
	
	// 4. Считываем готовый текст обратно, чтобы передать на экран
	Чтение = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ИтоговыйHTML = Чтение.Прочитать();
	Чтение.Закрыть();
	
	// 5. НА СЕРВЕРЕ мгновенно удаляем файл. На диске ничего не остаётся!
	УдалитьФайлы(ПутьКФайлу);
	
	Возврат ИтоговыйHTML;

КонецФункции

&НаКлиЕнте
Процедура ПросмотрПечати(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ПоказатьПредупреждение(, "Пожалуйста, сначала выберите сотрудника на форме договора!");
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("НомерДоговора", Объект.НомерДоговора);
	Данные.Вставить("ДатаДоговора",  Объект.ДатаДоговора);
	
	ЗаполнитьДанныеИзБазыНаСервере(Данные, Объект.Организация, Объект.Сотрудник);
	
	Попытка
		// Сервер сам всё соберёт, удалит за собой файл и вернёт нам чистый HTML-текст
		ЭтаФорма.ТекстДоговораДляПросмотра = СформироватьДоговорНаСервере(Данные);
	Исключение
		ПоказатьПредупреждение(, "Ошибка при создании документа: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
